testcases/narrow_channel/0/Psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 4800
(
    -1.1536982351695373
-1.1440032920168521
-1.134308348864167
-1.1246134057114816
-1.1149184625587967
-1.1052235194061115
-1.0955285762534261
-1.085833633100741
-1.0761386899480556
...
);

boundaryField
{
    top
    {
        type            fixedValue;
        value nonuniform List<scalar> 120
        (
            -1.1536982351695373
-1.1440032920168521
-1.134308348864167
-1.1246134057114816
-1.1149184625587967
-1.1052235194061115
-1.0955285762534261
-1.085833633100741
-1.0761386899480556
...
        );
    }

    bottom
    {
        type            fixedValue;
        value nonuniform List<scalar> 120
        (
            -1.1536982351695373
-1.1440032920168521
-1.134308348864167
-1.1246134057114816
-1.1149184625587967
-1.1052235194061115
-1.0955285762534261
-1.085833633100741
-1.0761386899480556
...
        );
    }

    left
    {
        type            fixedValue;
        value nonuniform List<scalar> 40
        (
            -1.1536983163650816
            -1.0393062137758848
            -0.9379453337801389
            -0.847977606053768
            -0.7680487116856582
            -0.6970250371348046
            -0.6339476510567832
            -0.5779990142245846
            -0.528478055169429
...
        );
    }

    right
    {
        type            fixedValue;
        value nonuniform List<scalar> 40
        (
            0.004882422230139349
0.11927452481933609
0.22063540481508204
0.3106031325414529
0.3905320269095627
0.46155570146041636
0.5246330875384377
0.5805817243706364
0.6301026834257919
...
        );
    }

    front
    {
        type            empty;    }

    back
    {
        type            empty;    }

}


// ************************************************************************* //
