testcases/narrow_channel/0/n1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      n1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform 0.5;


boundaryField
{
    top
    {
        type            fixedValue;
        value uniform 1.584947136820922;
    }


    bottom
    {
        type            fixedValue;
        value uniform 1.584947136820922;

    }

    left
    {

                              type            fixedValue;
        value nonuniform List<scalar> 40
        (
        1.5849472655115726
1.4136274116556167
1.2773634554817552
1.1674599728703396
1.0777780180711571
1.00388538518915
0.942518690108106
0.8912340832355385
0.8481742970041154
...
        );
    }

    right
    {
                             type            fixedValue;
        value nonuniform List<scalar> 40
        (
        1.5849472655115726
1.4136274116556167
1.2773634554817552
1.1674599728703396
1.0777780180711571
1.00388538518915
0.942518690108106
0.8912340832355385
0.8481742970041154
...
        );
    }

    front
    {
        type            empty;    }

    back
    {
        type            empty;    }

}


// ************************************************************************* //
