testcases/narrow_channel/0/n2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      n2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField  uniform 0.5;


boundaryField
{
    top
    {
        type            fixedValue;
        value uniform 0.1577339673936688;
    }

    bottom
    {
        type            fixedValue;
        value uniform 0.1577339673936688;
    }

    left
    {

                              type            fixedValue;
        value nonuniform List<scalar> 40
        (
        0.15773395458637396
0.1768499945167335
0.19571563514451176
0.21414010399461075
0.23195871117079553
0.24903241315032745
0.26524672945352973
0.28050991844073037
0.2947507380063734
...
        );
    }

 right
    {
                             type            fixedValue;
        value nonuniform List<scalar> 40
        (
         0.15773395458637396
0.1768499945167335
0.19571563514451176
0.21414010399461075
0.23195871117079553
0.24903241315032745
0.26524672945352973
0.28050991844073037
0.2947507380063734
...
        );
    }

    front
    {
        type            empty;    }

    back
    {
        type            empty;    }

}


// ************************************************************************* //
