testcases/narrow_channel/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

eta             0.9284615447331176;

z1              1;

z2              -1;

beta            2.413709872073377e+20;

zeta1           0.5;

zeta2           0.5;

e              1.6e-19;

kappa_d         1025253500.0710667;

I               1;

// ************************************************************************* //
