testcases/narrow_channel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.0;
    }


    pFinal
    {
        $p;
        relTol          0;
    }

    "(n1|n2)"
    {
        solver PBiCG;
        preconditioner DILU;
        tolerance 1e-9;
        relTol 0;
    }

    U
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.0;
    }



    Psi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.0;
    }

    UFinal
    {
        $U;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(n1|n2)Final"
    {
        $n1;
        relTol          0;
    }

    PsiFinal
    {
        $Psi;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors   3;
    nOuterCorrectors  1000000;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
    pRefCell        0;
    pRefValue       0;
    residualControl
    {
        U
        {
            tolerance 4e-9;
            relTol 0.0;
        }
        p
        {
            tolerance 1e-9;
            relTol 0.0;
        }
        Psi
        {
            tolerance 1e-12;
            relTol 0.0;
        }
        "(n1|n2)"
        {
            tolerance 1e-9;
            relTol 0.0;
        }
    }
}



relaxationFactors
{
    fields
    {
        "(U|p|Psi)" 0.4;
        "(U|n1|n2|Psi|p)Final" 1;
        "(n1|n2)" 0.4;
;
    }
}


// ************************************************************************* //
